In [3]:
import pandas as pd
import numpy as np

In [4]:
d={'USN':[100,101,102],
   'Name':['Arjun','Anki','jerry'],
   'Mobile':[34,56,43],
   'Marks':[23,23,35]
}

In [5]:
data=pd.DataFrame(d)

In [6]:
data

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23
2  102  jerry      43     35

In [7]:
data.head(2)

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23

In [8]:
data.tail(1)

   USN   Name  Mobile  Marks
2  102  jerry      43     35

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   Marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [10]:
data.columns

Index(['USN', 'Name', 'Mobile', 'Marks'], dtype='object')

In [11]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
data.isnull()

     USN   Name  Mobile  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [13]:
data['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [14]:
data[['USN','Name']]

   USN   Name
0  100  Arjun
1  101   Anki
2  102  jerry

In [15]:
#conditional selection

In [16]:
data['Marks']<35

0     True
1     True
2    False
Name: Marks, dtype: bool

In [17]:
data['Marks']>=35

0    False
1    False
2     True
Name: Marks, dtype: bool

In [18]:
rec=data['Marks']>=35
data[rec]

   USN   Name  Mobile  Marks
2  102  jerry      43     35

In [19]:
data[rec]['Name']

2    jerry
Name: Name, dtype: object

In [22]:
data.set_index['Name']

TypeError: 'method' object is not subscriptable

In [23]:
data[(data['USN']>101) | (data['Marks']>20)]

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23
2  102  jerry      43     35

In [24]:
data[(data['USN']>101) & (data['Marks']>20)]

   USN   Name  Mobile  Marks
2  102  jerry      43     35

In [30]:
data['Age']=[19,18,19]

In [31]:
data

   USN   Name  Mobile  Marks  Age
0  100  Arjun      34     23   19
1  101   Anki      56     23   18
2  102  jerry      43     35   19

In [37]:
data.drop('Age',axis=1)

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23
2  102  jerry      43     35

In [38]:
data

   USN   Name  Mobile  Marks  Age
0  100  Arjun      34     23   19
1  101   Anki      56     23   18
2  102  jerry      43     35   19

In [42]:
data.drop('Age',axis=1,inplace=True)
#permanently delete the column

In [40]:
data

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23
2  102  jerry      43     35

In [43]:
data.drop(2)

   USN   Name  Mobile  Marks
0  100  Arjun      34     23
1  101   Anki      56     23